/* Задача 21: Напишите программу, которая принимает 
на вход координаты двух точек и находит расстояние между ними в 3D пространстве.*/
// Создаю переменную Ui - User Input на каждую координату
int UiXa = 0;
int UiYa = 0;
int UiZa = 0;
int UiXb = 0;
int UiYb = 0;
int UiZb = 0;
// Запросы ввода
Console.Write("Пожалуйста, введите координату X первого числа: ");
UiXa = int.Parse(Console.ReadLine());
Console.Write("Пожалуйста, введите координату Y первого числа: ");
UiYa = int.Parse(Console.ReadLine());
Console.Write("Пожалуйста, введите координату Z первого числа: ");
UiZa = int.Parse(Console.ReadLine());
Console.Write("Пожалуйста, введите координату X второго числа: ");
UiXb = int.Parse(Console.ReadLine());
Console.Write("Пожалуйста, введите координату Y второго числа: ");
UiYb = int.Parse(Console.ReadLine());
Console.Write("Пожалуйста, введите координату Z второго числа: ");
UiZb = int.Parse(Console.ReadLine());
//



    