/* Задача 21: Напишите программу, которая принимает 
на вход координаты двух точек и находит расстояние между ними в 3D пространстве.*/
// Создаю переменную Ui - User Input на каждую координату
int UiXa = 0;
int UiYa = 0;
int UiXb = 0;
int UiYb = 0;
int UiXc = 0;
int UiYc = 0;
// Запросы ввода
Console.Write("Пожалуйста, введите координату X первого числа: ");
UiXa = int.Parse(Console.ReadLine());
Console.Write("Пожалуйста, введите координату X первого числа: ");
UiYa = int.Parse(Console.ReadLine());
Console.Write("Пожалуйста, введите координату X первого числа: ");
UiXb = int.Parse(Console.ReadLine());
Console.Write("Пожалуйста, введите координату X первого числа: ");
UiYb = int.Parse(Console.ReadLine());
Console.Write("Пожалуйста, введите координату X первого числа: ");
UiXc = int.Parse(Console.ReadLine());
Console.Write("Пожалуйста, введите координату X первого числа: ");
UiYc = int.Parse(Console.ReadLine());




    